namespace Cripto.Workspace;

public static partial class Conditions
{
    public static Dictionary<char, long> Alphabet = new()
    {
        { 'А', 5 },
        { 'Б', 7 },
        { 'В', 27 },
        { 'Г', 21 },
        { 'Д', 3 },
        { 'Е', 10 },
        { 'Ж', 8 },
        { 'З', 16 },
        { 'И', 14 },
        { 'Й', 15 },
        { 'К', 31 },
        { 'Л', 17 },
        { 'М', 18 },
        { 'Н', 9 },
        { 'О', 20 },
        { 'П', 12 },
        { 'Р', 23 },
        { 'С', 24 },
        { 'Т', 25 },
        { 'У', 6 },
        { 'Ф', 11 },
        { 'Х', 4 },
        { 'Ц', 22 },
        { 'Ч', 28 },
        { 'Ш', 29 },
        { 'Щ', 30 },
        { 'Ъ', 1 },
        { 'Ы', 2 },
        { 'Ь', 19 },
        { 'Э', 0 },
        { 'Ю', 13 },
        { 'Я', 26 }
    };
}